# Product Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..Product Property
Application Class See Also
---
The product type for the current session of Revit.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ProductType Product { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Product As ProductType
	Get
```

Visual C++
---
```text
public:
property ProductType Product {
	ProductType get ();
}
```

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace